git
make
automake
gcc
gcc-c++
ninja-build
gettext
cmake
unzip
curl
ripgrep
python3
python3-pip
python3-virtualenv
nodejs
npm
cargo
pkgconf
fontconfig-devel
fd-find
fzf
jq
python3-pytest
python3-neovim
python-lsp-server
black
python3-flake8
python3-pycodestyle
python3-pyflakes
pylint
python3-autopep8
alacritty
flatpak
protobuf-compiler
htop
wl-clipboard
transmission
vlc
pipewire
wireguard
bison
