git
build-essential
telegram-desktop
keepassxc
ninja-build
gettext
cmake
unzip
curl
ripgrep
python3
python3-pip
python3-venv
nodejs
npm
rustc
cargo
pkgconf
libfontconfig1-dev
fd-find
ksnip
fzf
jq
