git
build-essential
telegram-desktop
keepassxc
ninja-build
gettext
cmake
unzip
curl
ripgrep
python3
python3-pip
python3-venv
nodejs
npm
rustc
cargo
pkgconf
libfontconfig1-dev
fd-find
ksnip
fzf
jq
python3-pytest
python3-pynvim
python3-pylsp
python3-black
python3-flake8
python3-pycodestyle
python3-pyflakes
python3-pylint
python3-autopep8
default-jre
alacritty
