git
build-essential
ninja-build
gettext
cmake
unzip
curl
ripgrep
python3
python3-pip
python3-venv
nodejs
npm
cargo
pkgconf
libfontconfig1-dev
fd-find
fzf
jq
python3-pytest
python3-pynvim
python3-pylsp
black
python3-flake8
python3-pycodestyle
python3-pyflakes
pylint
python3-autopep8
default-jre
alacritty
flatpak
gnome-software-plugin-flatpak
docker.io
protobuf-compiler
htop
wl-clipboard
transmission
vlc
pipewire
